tutorials/cases/canonical/gasification/system/regressionFunctions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

regressionBase
{
    type            volFieldValue;
    libs            (fieldFunctionObjects);
    regionType      all;
    postOperation   none;
    weightField     none;
    writeFields     false;
    writePrecision  10;
    writeToFile     true;
    log             false;
    enabled         false;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   -1;
}

regressionTsAverage
{
    ${regressionBase}
    enabled         true;
    fields          (Ts);
    operation       volAverage;
}

regressionPorosityAverage
{
    ${regressionBase}
    enabled         true;
    fields          (porosityF);
    operation       volAverage;
}

regressionCharIntegral
{
    ${regressionBase}
    enabled         true;
    fields          (Ychar);
    operation       volIntegrate;
}

regressionCOAverage
{
    ${regressionBase}
    enabled         true;
    fields          (CO);
    operation       volAverage;
}

regressionCO2Average
{
    ${regressionBase}
    enabled         true;
    fields          (CO2);
    operation       volAverage;
}

// ************************************************************************* //
